simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    SLAVE_LOG_PRINTF(
        "[SLAVE] RX_SCAN p4=%lu/%u p5=%lu/%u p12=%lu/%u p13=%lu/%u p14=%lu/%u "
        "p18=%lu/%u p19=%lu/%u p21=%lu/%u p22=%lu/%u p25=%lu/%u p27=%lu/%u p32=%lu/%u p33=%lu/%u\n",
        (unsigned long)edges[0], (unsigned)levels[0],
        (unsigned long)edges[1], (unsigned)levels[1],
        (unsigned long)edges[2], (unsigned)levels[2],
        (unsigned long)edges[3], (unsigned)levels[3],
        (unsigned long)edges[4], (unsigned)levels[4],
        (unsigned long)edges[5], (unsigned)levels[5],
        (unsigned long)edges[6], (unsigned)levels[6],
        (unsigned long)edges[7], (unsigned)levels[7],
        (unsigned long)edges[8], (unsigned)levels[8],
        (unsigned long)edges[9], (unsigned)levels[9],
        (unsigned long)edges[10], (unsigned)levels[10],
        (unsigned long)edges[11], (unsigned)levels[11],
        (unsigned long)edges[12], (unsigned)levels[12]);
}
#endif

/* ── Objetos ─────────────────────────────────────────────────────────────── */
static PsocUART       psoc;
static EspNowTransport transport;

/* Helpers de pulsos GPIO de osciloscopio (módulo aparte). */
#include "scope_pulse.h"

static bool sameMac(const uint8_t a[6], const uint8_t b[6])
{
    return memcmp(a, b, 6) == 0;
}

static bool usableUnicastMac(const uint8_t mac[6])
{
    static const uint8_t zero[6] = {0, 0, 0, 0, 0, 0};
    static const uint8_t broadcast[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    return !sameMac(mac, zero) && !sameMac(mac, broadcast);
}

static bool masterMacIsDefaultBroadcast()
{
    return !usableUnicastMac(MASTER_MAC_DEFAULT);
}

static void learnMasterMac(const uint8_t mac[6])
{
    if (!usableUnicastMac(mac) || sameMac(g_masterTxMac, mac)) return;
    if (!transport.setMasterMac(mac)) {
        SLAVE_LOG_PRINTLN("[SLAVE] master MAC learn failed");
        return;
    }
    memcpy(g_masterTxMac, mac, 6);
    SLAVE_LOG_PRINTF("[SLAVE] master MAC learned %02X:%02X:%02X:%02X:%02X:%02X%s\n",
                     g_masterTxMac[0], g_masterTxMac[1], g_masterTxMac[2],
                     g_masterTxMac[3], g_masterTxMac[4], g_masterTxMac[5],
                     masterMacIsDefaultBroadcast() ? " (auto)" : "");
}

static esp_err_t sendToMaster(const uint8_t *data, size_t len)
{
    return espnowSend(g_masterTxMac, data, len);
}

static void sendCfgAck(uint8_t sub_cmd, uint8_t ok);
static void sendCompletionAckWithRetry(uint8_t sub_cmd);
static void allocStore(uint16_t n_batches);
static void enterHotWait(uint16_t n_batches);
static uint16_t clampPsocCaptureBatches(uint16_t n);
static uint32_t expectedCaptureMs(uint16_t n_batches);
static bool storeReadyForHotWait();
static void serviceHotWaitWatchdog();
static void debugEspSetRamp(bool enable);

static void IRAM_ATTR onPsocRxEdge()
{
    g_psoc_rx_edges++;
    g_psoc_rx_last_level = (uint8_t)digitalRead(PSOC_UART_RX);
}

static void logPsocUartDiag(const char *tag)
{
    const unsigned long bytes = (unsigned long)psoc.bytesRx();
    const unsigned long mark  = (unsigned long)psoc.markersRx();
    const unsigned long drop  = (unsigned long)psoc.syncDrops();
    const unsigned long badLn = (unsigned long)psoc.badLen();
    const unsigned long ping  = (unsigned long)psoc.pingsRx();
    const unsigned long diag  = (unsigned long)psoc.diagEventsRx();
    const int rxLevel = digitalRead(PSOC_UART_RX);
    uint32_t rxEdges;
    uint8_t rxEdgeLevel;

    noInterrupts();
    rxEdges = g_psoc_rx_edges;
    rxEdgeLevel = g_psoc_rx_last_level;
    interrupts();

    if (psoc.hasLastByte()) {
        SLAVE_LOG_PRINTF(
            "[SLAVE %d] %s bOK=%lu bBad=%lu uartBytes=%lu mark=%lu drop=%lu badLen=%lu ping=%lu diag=%lu rx=%d edge=%lu/%u last=0x%02X age=%lu txOK=%lu txFail=%lu state=%d fill=%u/%u fs=%u\n",
            NODE_ID, tag,
            (unsigned long)psoc.batchesOK(), (unsigned long)psoc.batchesBad(),
            bytes, mark, drop, badLn, ping, diag, rxLevel,
            (unsigned long)rxEdges, (unsigned)rxEdgeLevel,
            psoc.lastByte(), (unsigned long)psoc.lastByteAgeMs(),
            (unsigned long)transport.sentOK(), (unsigned long)transport.sentFail(),
            (int)g_state, (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
            (unsigned)psoc.sampleRate());
    } else {
        SLAVE_LOG_PRINTF(
            "[SLAVE %d] %s bOK=%lu bBad=%lu uartBytes=%lu mark=%lu drop=%lu badLen=%lu ping=%lu diag=%lu rx=%d edge=%lu/%u last=none txOK=%lu txFail=%lu state=%d fill=%u/%u fs=%u\n",
            NODE_ID, tag,
            (unsigned long)psoc.batchesOK(), (unsigned long)psoc.batchesBad(),
            bytes, mark, drop, badLn, ping, diag, rxLevel,
            (unsigned long)rxEdges, (unsigned)rxEdgeLevel,
            (unsigned long)transport.sentOK(), (unsigned long)transport.sentFail(),
            (int)g_state, (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
            (unsigned)psoc.sampleRate());
    }
}

static const char *psocDiagName(uint8_t event)
{
    switch (event) {
        case PSOC_EVT_BOOT:           return "BOOT";
        case PSOC_EVT_ANALOG_READY:   return "ANALOG_READY";
        case PSOC_EVT_CAL_START:      return "CAL_START";
        case PSOC_EVT_CAL_DONE:       return "CAL_DONE";
        case PSOC_EVT_CAL_BUSY:       return "CAL_BUSY";
        case PSOC_EVT_CAL_STAGE_DAC:  return "CAL_STAGE_DAC";
        case PSOC_EVT_CAL_STAGE_MEAS: return "CAL_STAGE_MEAS";
        case PSOC_EVT_CAL_STAGE_BEGIN:return "CAL_STAGE_BEGIN";
        case PSOC_EVT_CAL_STAGE_OK:   return "CAL_STAGE_OK";
        case PSOC_EVT_CAL_VERIFY_BEGIN:return "CAL_VERIFY_BEGIN";
        case PSOC_EVT_CAL_VERIFY_OK:  return "CAL_VERIFY_OK";
        case PSOC_EVT_CAL_AMUX_IN:    return "CAL_AMUX_IN";
        case PSOC_EVT_CAL_PROGRESS:   return "CAL_PROGRESS";
        case PSOC_EVT_CAL_WATCHDOG:   return "CAL_WATCHDOG";
        case PSOC_EVT_CAL_LP_BAD:     return "CAL_LP_BAD";
        case PSOC_EVT_CAL_STAGE_MEAS32: return "CAL_STAGE_MEAS32";
        case PSOC_EVT_SERVO_STAGE:    return "SERVO_STAGE";
        case PSOC_EVT_SERVO_STEP:     return "SERVO_STEP";
        case PSOC_EVT_WAIT_ESP:       return "WAIT_ESP";
        case PSOC_EVT_ESP_SEEN:       return "ESP_SEEN";
        case PSOC_EVT_CAL_LOOP:       return "CAL_LOOP";
        case PSOC_EVT_CAL_STAGE_SAT:  return "CAL_STAGE_SAT";
        case PSOC_EVT_CAL_STAGE_SAT_ALL: return "CAL_STAGE_SAT_ALL";
        case PSOC_EVT_CAL_REALCHECK_BEGIN: return "CAL_REALCHECK_BEGIN";
        case PSOC_EVT_CAL_REALCHECK_DAC: return "CAL_REALCHECK_DAC";
        case PSOC_EVT_CAL_REALCHECK_MEAS32: return "CAL_REALCHECK_MEAS32";
        case PSOC_EVT_CAL_REALCHECK_NUDGE: return "CAL_REALCHECK_NUDGE";
        case PSOC_EVT_CAL_REALCHECK_OK: return "CAL_REALCHECK_OK";
        case PSOC_EVT_CAL_STAGE_TARGET32: return "CAL_STAGE_TARGET32";
        case PSOC_EVT_CAL_SWEEP_DAC: return "CAL_SWEEP_DAC";
        case PSOC_EVT_CAL_SWEEP_MEAS32: return "CAL_SWEEP_MEAS32";
        case PSOC_EVT_ADC_SNAPSHOT_BEGIN: return "ADC_SNAPSHOT_BEGIN";
        case PSOC_EVT_ADC_RAW32: return "ADC_RAW32";
        case PSOC_EVT_ADC_FILT32: return "ADC_FILT32";
        case PSOC_EVT_RX_CMD:         return "RX_CMD";
        case PSOC_EVT_SETN:           return "SETN";
        case PSOC_EVT_ARMED:          return "ARMED";
        case PSOC_EVT_SYNC_RISE:      return "SYNC_RISE";
        case PSOC_EVT_SYNC_FALL:      return "SYNC_FALL";
        case PSOC_EVT_SAMPLING_START: return "SAMPLING_START";
        case PSOC_EVT_CAPTURE_DONE:   return "CAPTURE_DONE";
        case PSOC_EVT_DUMP_START:     return "DUMP_START";
        case PSOC_EVT_DUMP_DONE:      return "DUMP_DONE";
        case PSOC_EVT_CHAIN_NEXT:     return "CHAIN_NEXT";
        case PSOC_EVT_START_NOW:      return "START_NOW";
        case PSOC_EVT_DEBUG_MODE:     return "DEBUG_MODE";
        case PSOC_EVT_STATUS_REQ:     return "STATUS_REQ";
        case PSOC_EVT_BUTTON:         return "BUTTON";
        case PSOC_EVT_BUTTON_IGNORED: return "BUTTON_IGNORED";
        case PSOC_EVT_CAPTURE_CLAMPED:return "CAPTURE_CLAMPED";
        case PSOC_EVT_CAL_PI_GAIN32:  return "CAL_PI_GAIN32";
        case PSOC_EVT_CAL_PI_DEADBAND:return "CAL_PI_DEADBAND";
        case PSOC_EVT_CAL_PI_ERROR32: return "CAL_PI_ERROR32";
        case PSOC_EVT_CAL_PI_BUCKET32:return "CAL_PI_BUCKET32";
        case PSOC_EVT_CAL_PI_STABLE:  return "CAL_PI_STABLE";
        case PSOC_EVT_CAL_AMUX_CAP:   return "CAL_AMUX_CAP";
        default:                      return "UNKNOWN";
    }
}

static const char *psocStateName(uint8_t state)
{
    switch (state) {
        case 0:  return "IDLE";
        case 1:  return "ARMED";
        case 2:  return "SAMPLING";
        case 3:  return "CALIBRATING";
        default: return "UNKNOWN";
    }
}

static uint8_t g_psoc_hw_class = 0xFFu;

/* Estado de la SD del PSoC (2026-07-11): la SD vive en el PSoC (SPI Master de
 * TopDesign), NO en el ESP32 — sd_storage.* queda obsoleto/stub. El PSoC
 * reporta PSOC_EVT_SD_STATUS en boot y ante PSOC_CMD_SD_STATUS; con firmware
 * PSoC viejo (sin 0xBC) no llega nunca → sd_present=0. */
static uint8_t g_psoc_sd_status = 0u;   /* +bit4 FAT montado, bit5 sesión COMPLETE */
static bool    g_psoc_sd_known  = false;

static uint8_t psocSdPresent() { return (uint8_t)(g_psoc_sd_status & 0x01u); }

static const char *psocHwName(uint8_t hwClass)
{
    switch (hwClass) {
        case 0:  return "GEO";
        case 1:  return "HAMMER";
        default: return "UNKNOWN";
    }
}

