simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static const char *psocCalStageName(uint8_t stage)
{
    if (g_psoc_hw_class == 1u) {
        switch (stage) {
            case 0:  return "HAMMER_PGA";
            case 1:  return "HAMMER_LP";
            default: return "UNKNOWN";
        }
    } else {
        switch (stage) {
            case 0:  return "GEO_PGA";
            case 1:  return "GEO_BP";
            case 2:  return "GEO_ADDER";
            case 3:  return "GEO_LP";
            default: return "UNKNOWN";
        }
    }
}

static uint32_t absCounts32(int32_t value)
{
    return (value < 0) ? (uint32_t)(-value) : (uint32_t)value;
}

static int32_t psocCalCompareCounts(int32_t raw)
{
    return (g_psoc_hw_class == 1u) ? (int32_t)absCounts32(raw) : raw;
}

static int32_t adcCountsToMv(int32_t counts)
{
    const int64_t scaled = (int64_t)counts * 1000LL;
    if (scaled >= 0) {
        return (int32_t)((scaled + 26214LL) / 52429LL);
    }
    return (int32_t)((scaled - 26214LL) / 52429LL);
}

static int16_t clampInt16(int32_t value)
{
    if (value > 32767L) return 32767;
    if (value < -32768L) return -32768;
    return (int16_t)value;
}

static void sendCfgAckS16(uint8_t hiBase, uint8_t loBase, uint8_t stage, int32_t value)
{
    const int16_t clipped = clampInt16(value);
    const uint16_t raw = (uint16_t)clipped;
    sendCfgAck((uint8_t)(hiBase + stage), (uint8_t)((raw >> 8) & 0xFFu));
    sendCfgAck((uint8_t)(loBase + stage), (uint8_t)(raw & 0xFFu));
}

static void onPsocDiag(const PsocDiagEvent &event)
{
    static uint8_t calStage = 0xFF;
    static uint8_t calDac = 0;
    static int16_t calMeas = 0;
    static bool calMeasHigh = false;
    static uint32_t calMeasRaw = 0;
    static int32_t calMeasRawSigned = 0;
    static uint8_t calMeasRawByte = 0;
    static uint32_t calTargetRaw = 0;
    static int32_t calTargetSigned = 0;
    static uint8_t calTargetRawByte = 0;
    static bool calTargetValid = false;
    static uint32_t calSweepRaw = 0;
    static uint8_t calSweepRawByte = 0;
    static uint32_t adcSnapshotRaw = 0;
    static uint8_t adcSnapshotRawByte = 0;
    static uint32_t calPiRaw = 0;
    static uint8_t calPiRawByte = 0;
    static uint8_t calPiRawEvent = 0;
    static uint16_t calPointIndex = 0;
    g_psocConnected = true;

    if (g_state == SAMPLING &&
        event.event != PSOC_EVT_DUMP_DONE &&
        event.event != PSOC_EVT_CAPTURE_DONE &&
        event.event != PSOC_EVT_SD_SESSION &&
        event.event != PSOC_EVT_SD_ERROR) {
        return;
    }

    if (g_psoc_sd_store_active && g_state == SAMPLING) {
        if (event.event == PSOC_EVT_SD_ERROR) {
            g_psoc_sd_capture_error = true;
        } else if (event.event == PSOC_EVT_SD_SESSION) {
            g_psoc_sd_session_complete = (event.value == 1u);
            if (!g_psoc_sd_session_complete) g_psoc_sd_capture_error = true;
        } else if (event.event == PSOC_EVT_DUMP_DONE &&
                   (g_view_store_active || g_start_store_active)) {
            const bool wasView = g_view_store_active;
            const uint8_t doneSubCmd = wasView ? CMD_VIEW : CMD_START;
            const bool ok = g_psoc_sd_session_complete && !g_psoc_sd_capture_error;
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);
            g_view_store_active = false;
            g_start_store_active = false;
            g_store_fill = ok ? g_rec_n_batches : 0u;
            g_state = STOPPED;
            if (ok) sendCompletionAckWithRetry(doneSubCmd);
            else sendCfgAck(doneSubCmd, 0u);
            SLAVE_LOG_PRINTF("[SLAVE] %s SD complete=%u err=%u fill=%u/%u\n",
                             wasView ? "VIEW" : "START",
                             (unsigned)g_psoc_sd_session_complete,
                             (unsigned)g_psoc_sd_capture_error,
                             (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
            LOGM("CAPTURE_SD_DONE", "mode=%s,ok=%u,fill=%u,n=%u",
                 wasView ? "VIEW" : "START", (unsigned)ok,
                 (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
            return;
        }
    }

    if (!g_psoc_sd_store_active && event.event == PSOC_EVT_DUMP_DONE &&
        (g_view_store_active || g_start_store_active) &&
        g_state == SAMPLING && g_store_fill < g_rec_n_batches) {
        const bool wasView = g_view_store_active;
        const uint8_t doneSubCmd = wasView ? CMD_VIEW : CMD_START;
        const char *doneName = wasView ? "VIEW" : "START";
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_view_store_active = false;
        g_start_store_active = false;
        g_state = STOPPED;
        sendCfgAck(doneSubCmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] %s partial dump fill=%u/%u -> FAIL\n",
                         doneName, (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
        LOGM("CAPTURE_PARTIAL", "mode=%s,fill=%u,n=%u,bOK=%lu,bBad=%lu,drop=%lu,bytes=%lu",
             doneName,
             (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
             (unsigned long)psoc.batchesOK(),
             (unsigned long)psoc.batchesBad(),
             (unsigned long)psoc.syncDrops(),
             (unsigned long)psoc.bytesRx());
    }

    if (event.event == PSOC_EVT_BOOT) {
        g_psoc_hw_class = event.value;
        SLAVE_LOG_PRINTF("[PSoC] boot hw=%u/%s pstate=%u/%s\n",
                         event.value, psocHwName(event.value),
                         event.psoc_state, psocStateName(event.psoc_state));
        LOGM("PSOC_BOOT", "hw=%u,hwName=%s,pstate=%u,pstateName=%s",
             event.value, psocHwName(event.value),
             event.psoc_state, psocStateName(event.psoc_state));
    }

    if (event.event == PSOC_EVT_SD_STATUS) {
        g_psoc_sd_status = event.value;
        g_psoc_sd_known = true;
        g_psoc_sd_capture_enabled = (event.value & 0x40u) != 0u;
        SLAVE_LOG_PRINTF("[PSoC] SD status=0x%02X present=%u type=%u selftest=%u\n",
                         event.value, (unsigned)(event.value & 1u),
                         (unsigned)((event.value >> 1) & 3u),
                         (unsigned)((event.value >> 3) & 1u));
        LOGM("PSOC_SD", "status=0x%02X,present=%u", event.value, (unsigned)(event.value & 1u));
    } else if (event.event == PSOC_EVT_SD_SESSION || event.event == PSOC_EVT_SD_ERROR) {
        SLAVE_LOG_PRINTF("[PSoC] %s val=0x%02X\n",
                         (event.event == PSOC_EVT_SD_SESSION) ? "SD_SESSION" : "SD_ERROR",
                         event.value);
        LOGM("PSOC_SD", "evt=0x%02X,val=0x%02X", event.event, event.value);
    }

    if (event.event == PSOC_EVT_SETN) {
        g_psoc_last_setn_value = event.value;
        g_psoc_last_setn_ms = millis();
        g_psoc_setn_seq++;
        SLAVE_LOG_PRINTF("[PSoC] SETN ack val=%u pstate=%u/%s\n",
                         event.value, event.psoc_state, psocStateName(event.psoc_state));
    } else if (event.event == PSOC_EVT_ARMED ||
               event.event == PSOC_EVT_SAMPLING_START ||
               event.event == PSOC_EVT_CHAIN_NEXT ||
               event.event == PSOC_EVT_CAPTURE_DONE ||
               event.event == PSOC_EVT_DUMP_START ||
               event.event == PSOC_EVT_DUMP_DONE ||
               event.event == PSOC_EVT_CAPTURE_WATCHDOG) {
        SLAVE_LOG_PRINTF("[PSoC] %s val=%u pstate=%u/%s fill=%u/%u\n",
                         psocDiagName(event.event), event.value,
                         event.psoc_state, psocStateName(event.psoc_state),
                         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    }
    if (event.event == PSOC_EVT_ARMED) {
        g_psoc_arm_ready = true;
    }

