simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    if (!usbCommandStartsWithWord(cmd, word)) {
        return false;
    }
    while (*cmd != '\0' && *cmd != ' ' && *cmd != '=' && *cmd != ':') {
        cmd++;
    }
    while (*cmd != '\0' && index < 2u) {
        while (*cmd == ' ' || *cmd == '=' || *cmd == ':') {
            cmd++;
        }
        if (*cmd < '0' || *cmd > '9') {
            return false;
        }
        uint32_t acc = 0u;
        while (*cmd >= '0' && *cmd <= '9') {
            acc = (acc * 10u) + (uint32_t)(*cmd - '0');
            if (acc > 65535u) {
                return false;
            }
            cmd++;
        }
        values[index++] = acc;
        while (*cmd == ' ') {
            cmd++;
        }
    }
    if (index != 2u || *cmd != '\0') {
        return false;
    }
    first = (uint16_t)values[0];
    second = (uint16_t)values[1];
    return true;
}

static uint32_t usbCaptureTimeoutMs(uint16_t n)
{
    uint32_t timeoutMs = expectedCaptureMs(n) + 2000u;
    return (timeoutMs < 3000u) ? 3000u : timeoutMs;
}

static void serviceLabWaitSlice()
{
    psoc.poll();
    servicePsocConfigAck();
    delay(1);
}

static void waitForLabCaptureDone(const char *tag, uint16_t requestedBatches)
{
    const uint32_t timeoutMs = usbCaptureTimeoutMs(requestedBatches);
    const uint32_t startMs = millis();
    const uint32_t startOk = psoc.batchesOK();
    const uint32_t startBad = psoc.batchesBad();
    const uint32_t startBytes = psoc.bytesRx();

    while (g_state == SAMPLING &&
           (uint32_t)(millis() - startMs) < timeoutMs) {
        serviceLabWaitSlice();
    }

    const uint32_t elapsedMs = millis() - startMs;
    const bool full = (g_rec_n_batches > 0u &&
                       g_store_fill >= g_rec_n_batches &&
                       g_state == STOPPED);
    const bool timeout = (g_state == SAMPLING);
    SLAVE_LOG_PRINTF("[LAB] %s done=%u timeout=%u ms=%lu/%lu state=%d fill=%u/%u dOK=%lu dBad=%lu dBytes=%lu sync=%d\n",
                     tag, (unsigned)full, (unsigned)timeout,
                     (unsigned long)elapsedMs, (unsigned long)timeoutMs,
                     (int)g_state, (unsigned)g_store_fill,
                     (unsigned)g_rec_n_batches,
                     (unsigned long)(psoc.batchesOK() - startOk),
                     (unsigned long)(psoc.batchesBad() - startBad),
                     (unsigned long)(psoc.bytesRx() - startBytes),
                     digitalRead(SYNC_TO_PSOC_PIN));
    logPsocUartDiag(tag);
}

static void requestLabDiagFromUsb()
{
    SLAVE_LOG_PRINTF("[LAB] diag state=%d psoc=%u streamPga=%u pgavdac=%u vdac=%u syncOut=%d syncIn=%d\n",
                     (int)g_state, (unsigned)g_psocConnected,
                     (unsigned)g_pga_code, (unsigned)g_pgavdac,
                     (unsigned)g_vdac_byte, digitalRead(SYNC_TO_PSOC_PIN),
                     digitalRead(SYNC_IN_PIN));
    logPsocUartDiag("LAB_DIAG");
}

static void requestLabPinsFromUsb()
{
    uint32_t rxEdges;
    uint8_t rxEdgeLevel;
    noInterrupts();
    rxEdges = g_psoc_rx_edges;
    rxEdgeLevel = g_psoc_rx_last_level;
    interrupts();
    SLAVE_LOG_PRINTF("[LAB] pins syncOut=%d syncIn=%d psocRx=%d rxEdges=%lu rxEdgeLevel=%u\n",
                     digitalRead(SYNC_TO_PSOC_PIN), digitalRead(SYNC_IN_PIN),
                     digitalRead(PSOC_UART_RX), (unsigned long)rxEdges,
                     (unsigned)rxEdgeLevel);
}

static void requestQuietWindowFromUsb(uint16_t n, uint16_t ms)
{
    const uint32_t preBytes = psoc.bytesRx();
    const uint32_t prePing = psoc.pingsRx();
    const uint32_t preDiag = psoc.diagEventsRx();
    const uint32_t preOk = psoc.batchesOK();
    const uint32_t preBad = psoc.batchesBad();

    requestPrestartFromUsb(n);

    const uint32_t settleMs = millis();
    while (g_state == HOT_WAIT &&
           (uint32_t)(millis() - settleMs) < 25u) {
        psoc.poll();
        delay(1);
    }

    const uint32_t startBytes = psoc.bytesRx();
    const uint32_t startPing = psoc.pingsRx();
    const uint32_t startDiag = psoc.diagEventsRx();
    const uint32_t startOk = psoc.batchesOK();
    const uint32_t startBad = psoc.batchesBad();
    const uint32_t startMs = millis();

    while (g_state == HOT_WAIT &&
           (uint32_t)(millis() - startMs) < (uint32_t)ms) {
        psoc.poll();
        delay(1);
    }

    SLAVE_LOG_PRINTF("[LAB] quiet n=%u ms=%u state=%d settleBytes=%lu settlePing=%lu settleDiag=%lu winBytes=%lu winPing=%lu winDiag=%lu winOK=%lu winBad=%lu sync=%d\n",
                     (unsigned)n, (unsigned)ms, (int)g_state,
                     (unsigned long)(startBytes - preBytes),
                     (unsigned long)(startPing - prePing),
                     (unsigned long)(startDiag - preDiag),
                     (unsigned long)(psoc.bytesRx() - startBytes),
                     (unsigned long)(psoc.pingsRx() - startPing),
                     (unsigned long)(psoc.diagEventsRx() - startDiag),
                     (unsigned long)(psoc.batchesOK() - startOk),
                     (unsigned long)(psoc.batchesBad() - startBad),
                     digitalRead(SYNC_TO_PSOC_PIN));
    logPsocUartDiag("LAB_QUIET");
}

static void waitForLabStreamAck(uint8_t streamMode)
{
    const uint32_t startMs = millis();
    servicePsocConfigAck();
    if (g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[LAB] stream ack skipped pending=0x%02X\n", g_cfg_sub_cmd);
        return;
    }
    psoc.selectStream(streamMode);
    waitForPsocConfigAck(PSOC_CMD_SELECT_STREAM, streamMode);
    while (g_cfg_waiting && (uint32_t)(millis() - startMs) < 1000u) {
        serviceLabWaitSlice();
    }
    if (g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[LAB] stream %u ack timeout guard\n", (unsigned)streamMode);
        g_cfg_waiting = false;
    }
}

static void requestLabCaptureFromUsb(uint8_t streamMode, uint16_t n, const char *tag)
{
    waitForLabStreamAck(streamMode);
    requestCaptureFromUsb(n);
    waitForLabCaptureDone(tag, n);
}

/* Banco: leer un lote de GEOLAST.BIN (SD del PSoC) por 0xBF y volcarlo por USB
 * — mismo camino que usa handleReqBatch() para el maestro, pero verificable
 * sin radio. Requiere una captura SD previa completa (g_psoc_sd_store_active). */
static void requestSdReadFromUsb(uint16_t seq)
{
    if (!g_psoc_sd_store_active || g_store_fill == 0u) {
        SLAVE_LOG_PRINTF("[USB] sdread ignored: sin captura SD (fill=%u sd=%u)\n",
                         (unsigned)g_store_fill, (unsigned)g_psoc_sd_store_active);
        return;
    }
    if (seq >= g_store_fill) {
        SLAVE_LOG_PRINTF("[USB] sdread ignored: seq=%u fuera de rango (fill=%u)\n",
                         (unsigned)seq, (unsigned)g_store_fill);
        return;
    }
    if (g_psoc_sd_read_pending) {
        SLAVE_LOG_PRINTF("[USB] sdread ignored: lectura pendiente seq=%u\n",
                         (unsigned)g_psoc_sd_read_seq);
        return;
    }
    g_psoc_sd_read_pending = true;
    g_psoc_sd_read_usb = true;
    g_psoc_sd_read_seq = seq;
    g_psoc_sd_read_started_ms = millis();
    psoc.sdReadBatch(seq);
    LOGM("USB_CMD", "cmd=sdread,seq=%u", (unsigned)seq);
}
#endif

static void requestCalibrationFromUsb()
{
    const bool sent = requestPsocCalibration("USB");
    if (sent) {
        g_auto_cal_requested = true;
        g_auto_cal_due_ms = 0u;
    }
    LOGM("USB_CMD", "cmd=cal,ok=%u,sub=0x%02X",
         (unsigned)sent, PSOC_CMD_CALIBRATE);
}

static void requestAdcSnapshotFromUsb()
{
    const bool sent = requestPsocAdcSnapshot("USB");
    LOGM("USB_CMD", "cmd=adc,ok=%u,sub=0x%02X",
         (unsigned)sent, PSOC_CMD_ADC_SNAPSHOT);
}

