simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static void handleUsbCommand(const char *cmd)
{
    uint8_t value = 0u;
    uint16_t value16 = 0u;
    uint16_t value16b = 0u;
    if (cmd[0] == '\0') {
        return;
    }
    if (usbCommandEquals(cmd, "probe")) {
        requestProbeFromUsb();
    } else if (usbCommandEquals(cmd, "status") || usbCommandEquals(cmd, "s")) {
        requestStatusFromUsb();
    } else if (usbParseU16Param(cmd, "stream", value16)) {
        requestStreamFromUsb(value16);
    } else if (usbParseU16Param(cmd, "debugpsoc", value16) ||
               usbParseU16Param(cmd, "dpsoc", value16)) {
        requestDebugPsocFromUsb(value16);
    } else if (usbParseU16Param(cmd, "pre", value16) ||
               usbParseU16Param(cmd, "prestart", value16)) {
        requestPrestartFromUsb(value16);
    } else if (usbCommandEquals(cmd, "sync") || usbCommandEquals(cmd, "go")) {
        requestUsbStartFromHotWait();
    } else if (usbParseU16Param(cmd, "startnow", value16) ||
               usbParseU16Param(cmd, "now", value16)) {
        requestStartNowFromUsb(value16);
    } else if (usbParseU16Param(cmd, "cap", value16) ||
               usbParseU16Param(cmd, "capture", value16) ||
               usbParseU16Param(cmd, "start", value16)) {
        requestCaptureFromUsb(value16);
    } else if (usbCommandEquals(cmd, "clear") || usbCommandEquals(cmd, "flush")) {
        requestClearFromUsb();
    } else if (usbCommandEquals(cmd, "stop")) {
        requestStopFromUsb();
    } else if (usbCommandEquals(cmd, "c") ||
        usbCommandEquals(cmd, "cal") ||
        usbCommandEquals(cmd, "calibrate")) {
        requestCalibrationFromUsb();
    } else if (usbCommandEquals(cmd, "a") ||
               usbCommandEquals(cmd, "adc") ||
               usbCommandEquals(cmd, "snapshot")) {
        requestAdcSnapshotFromUsb();
    } else if (usbCommandEquals(cmd, "b") ||
               usbCommandEquals(cmd, "blink") ||
               usbCommandEquals(cmd, "titilar")) {
        requestBlinkFromUsb();
    } else if (usbParseGainParam(cmd, "pga", value)) {
        (void)requestPsocGainFromUsb(PSOC_CMD_PGA, value, "pga");
    } else if (usbParseGainParam(cmd, "pgavdac", value)) {
        (void)requestPsocGainFromUsb(PSOC_CMD_PGAVDAC, value, "pgavdac");
    } else if (usbParseGainParam(cmd, "range", value)) {
        (void)requestAdcConfigFromUsb(value);
    } else if (usbParseGainParam(cmd, "decim", value)) {
        (void)requestDecimationFromUsb(value);
    } else if (usbCommandEquals(cmd, "sdinfo")) {
        /* Re-init + estado de la SD del PSoC. Respuesta por evento SD_STATUS
         * (log [PSoC] SD status=...) y ack 0xBC. */
        psoc.sdStatus(1);
        LOGM("USB_CMD", "cmd=sdinfo,ok=1");
    } else if (usbCommandEquals(cmd, "sdtest")) {
        psoc.sdTest();
        LOGM("USB_CMD", "cmd=sdtest,ok=1");
    } else if (usbParseGainParam(cmd, "sdcap", value)) {
        psoc.sdCapture((uint8_t)value);
        LOGM("USB_CMD", "cmd=sdcap,value=%u", (unsigned)value);
#if SLAVE_LAB_TOOLS_ENABLE
    } else if (usbCommandEquals(cmd, "diag")) {
        requestLabDiagFromUsb();
    } else if (usbCommandEquals(cmd, "pins")) {
        requestLabPinsFromUsb();
    } else if (usbParseTwoU16Params(cmd, "quiet", value16, value16b)) {
        requestQuietWindowFromUsb(value16, value16b);
    } else if (usbParseU16Param(cmd, "capwait", value16)) {
        requestCaptureFromUsb(value16);
        waitForLabCaptureDone("LAB_CAPWAIT", value16);
    } else if (usbParseU16Param(cmd, "startwait", value16)) {
        requestStartNowFromUsb(value16);
        waitForLabCaptureDone("LAB_STARTWAIT", value16);
    } else if (usbParseU16Param(cmd, "rawcap", value16)) {
        requestLabCaptureFromUsb(0u, value16, "LAB_RAWCAP");
    } else if (usbParseU16Param(cmd, "fircap", value16)) {
        requestLabCaptureFromUsb(1u, value16, "LAB_FIRCAP");
    } else if (usbParseU16Param(cmd, "sdread", value16)) {
        requestSdReadFromUsb(value16);
#endif
    } else if (usbCommandEquals(cmd, "?") || usbCommandEquals(cmd, "help")) {
#if SLAVE_LAB_TOOLS_ENABLE
        SLAVE_LOG_PRINTF("[USB] commands: probe, status, stream N, debugpsoc N, pre N, sync, startnow N, cap N, clear, stop, cal, adc, blink, pga N, pgavdac N, range N, decim N, sdinfo, sdtest, sdcap N, diag, pins, quiet N MS, capwait N, startwait N, rawcap N, fircap N, sdread N\n");
#else
        SLAVE_LOG_PRINTF("[USB] commands: probe, status, stream N, debugpsoc N, pre N, sync, startnow N, cap N, clear, stop, cal, adc, blink, pga N, pgavdac N, range N, decim N\n");
#endif
        LOGM("USB_CMD", "cmd=help,ok=1");
    } else {
        SLAVE_LOG_PRINTF("[USB] unknown command '%s' (use: help)\n", cmd);
        LOGM("USB_CMD", "cmd=unknown,ok=0,text=%s", cmd);
    }
}

static void serviceUsbCommands()
{
    static char line[32];
    static uint8_t pos = 0;

    while (Serial.available() > 0) {
        char ch = (char)Serial.read();
        if (ch == '\r' || ch == '\n') {
            line[pos] = '\0';
            handleUsbCommand(line);
            pos = 0;
        } else if (ch == 8 || ch == 127) {
            if (pos > 0) { pos--; }
        } else if (ch >= 32 && ch <= 126) {
            if (pos < sizeof(line) - 1) {
                line[pos++] = ch;
            }
        }
    }
}
#else
static void serviceUsbCommands() {}
#endif

static void sendStartAck(uint8_t status, uint32_t startToken, uint32_t rxUs)
{
    MsgStartAck ack = { CMD_START_ACK, NODE_ID, status, startToken, rxUs };
    sendToMaster((const uint8_t *)&ack, sizeof(ack));
}

static void freeStoreRam()
{
    for (uint8_t i = 0; i < g_store_page_count && i < STORE_MAX_PAGES; i++) {
        free(g_store_pages[i]);
        g_store_pages[i] = nullptr;
    }
    for (uint8_t i = g_store_page_count; i < STORE_MAX_PAGES; i++) {
        g_store_pages[i] = nullptr;
    }
    g_store_page_count = 0;
    g_store_capacity_batches = 0;
    free(g_store_ts_us);
    g_store_ts_us = nullptr;
}

static bool storeRamReady()
{
    return (g_store_page_count > 0 &&
            g_store_capacity_batches >= g_rec_n_batches &&
            g_store_ts_us != nullptr);
}

static SampleBytes *storeBatchPtr(uint16_t seq)
{
    if (seq >= g_store_capacity_batches) return nullptr;
    const uint16_t page = seq / STORE_PAGE_BATCHES;
    const uint16_t inPage = seq % STORE_PAGE_BATCHES;
    if (page >= g_store_page_count || page >= STORE_MAX_PAGES) return nullptr;
    return g_store_pages[page]
        ? &g_store_pages[page][(size_t)inPage * SPI_BATCH_SAMPLES]
        : nullptr;
}

static bool storeReadyForHotWait()
{
    if (g_rec_n_batches == 0) return true;
    if (!g_psoc_arm_ready) return false;
    if (g_psoc_sd_store_active) return true;
    return storeRamReady();
}

static bool storeAllocated()
{
    if (g_rec_n_batches == 0) return true;
    return g_psoc_sd_store_active || storeRamReady();
}

