simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static uint16_t effectivePsocSampleRateHz()
{
    return psoc.sampleRate();
}

static uint16_t clampPsocCaptureBatches(uint16_t n)
{
    if (n > PSOC_SD_CAPTURE_MAX_BATCHES) {
        n = PSOC_SD_CAPTURE_MAX_BATCHES;
    }
    if (n > PSOC_CAPTURE_MAX_BATCHES) {
        if (g_psoc_sd_capture_enabled && psocSdPresent()) {
            return n;
        }
        return (uint16_t)PSOC_CAPTURE_MAX_BATCHES;
    }
    return n;
}

static uint32_t expectedCaptureMs(uint16_t n_batches)
{
    uint32_t fs = effectivePsocSampleRateHz();
    if (fs == 0) fs = PSOC_NATIVE_SAMPLE_RATE_HZ;
    uint32_t ms = ((uint32_t)n_batches * (uint32_t)SPI_BATCH_SAMPLES * 1000u + fs - 1u) / fs;
    return ms + PSOC_START_FALLBACK_EXTRA_MS;
}

static void enterHotWait(uint16_t n_batches)
{
    bool psocReady;

    n_batches = clampPsocCaptureBatches(n_batches);
    allocStore(n_batches);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    g_t_start_us     = 0;
    g_store_fill     = 0;
    g_view_remaining = 0;
    g_view_store_active = false;
    g_start_store_active = false;
    g_debug_count    = 0;
    g_debug_last_us  = (uint32_t)micros();
    g_start_fallback_sent = false;
    g_psoc_arm_ready = false;
    /* Armar el PSoC por UART: set N y pre-start (queda esperando flanco SYNC). */
    psocReady = sendAndConfirmPsocSetN(n_batches);
    if (!psocReady) {
        allocStore(0);
        g_state = STOPPED;
        sendHotWaitAck();   /* NACK explícito: el maestro no debe esperar READY */
        SLAVE_LOG_PRINTF("[SLAVE] HOT_WAIT aborted n=%u: PSoC SETN no confirmado\n",
                         (unsigned)n_batches);
        LOGM("HOTWAIT_ABORT", "n=%u,reason=setn_timeout", (unsigned)n_batches);
        return;
    }
    psoc.preStart();
    g_hotwait_enter_ms = millis();
    g_hotwait_rearm_count = 0;
    g_state = HOT_WAIT;
    SLAVE_LOG_PRINTF("[SLAVE] HOT_WAIT n=%u ready=%u\n",
                     n_batches, (unsigned)storeReadyForHotWait());
    LOGM("HOTWAIT", "n=%u,ready=%u,sync=%d,bytes=%lu",
         n_batches, (unsigned)storeReadyForHotWait(),
         digitalRead(SYNC_TO_PSOC_PIN), (unsigned long)psoc.bytesRx());
}

static void sendHotWaitAck()
{
    uint8_t ok = (g_state == HOT_WAIT && storeReadyForHotWait()) ? 1 : 0;
    MsgHotWaitAck ack = {
        CMD_HOTWAIT_ACK, NODE_ID, ok, (uint8_t)g_state, g_rec_n_batches
    };
    sendToMaster((const uint8_t *)&ack, sizeof(ack));
    SLAVE_LOG_PRINTF("[SLAVE] HOTWAIT_ACK ok=%u state=%u n=%u\n",
                     ok, (unsigned)g_state, g_rec_n_batches);
}

static void abortHotWait(const char *reason)
{
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    g_view_store_active = false;
    g_start_store_active = false;
    g_start_fallback_sent = false;
    allocStore(0);
    g_state = STOPPED;
    sendHotWaitAck();   /* ok=0 con state: NACK explícito hacia el maestro */
    SLAVE_LOG_PRINTF("[SLAVE] HOT_WAIT watchdog abort: %s\n", reason);
    LOGM("HOTWAIT_ABORT", "reason=%s", reason);
}

/* Watchdog de HOT_WAIT (desde loop()): si el PSoC nunca confirma ARMED
 * (p.ej. sd_session_begin falló y psoc_arm() salió sin armar), reintenta
 * preStart() hasta HOTWAIT_REARM_MAX veces y después aborta con NACK. Un
 * HOT_WAIT armado que el maestro nunca arranca también expira (caso maestro
 * reiniciado). Antes de esto el esclavo quedaba mudo hasta un power cycle. */
static void serviceHotWaitWatchdog()
{
    if (g_state != HOT_WAIT) {
        g_hotwait_rearm_count = 0;
        return;
    }
    uint32_t elapsed = millis() - g_hotwait_enter_ms;
    if (!g_psoc_arm_ready) {
        if (elapsed >= HOTWAIT_ABORT_MS) {
            abortHotWait("psoc_no_armed");
        } else if (g_hotwait_rearm_count < HOTWAIT_REARM_MAX &&
                   elapsed >= HOTWAIT_READY_TIMEOUT_MS *
                              (uint32_t)(g_hotwait_rearm_count + 1u)) {
            g_hotwait_rearm_count++;
            psoc.preStart();
            SLAVE_LOG_PRINTF("[SLAVE] HOT_WAIT re-arm #%u (sin PSOC_EVT_ARMED tras %lu ms)\n",
                             (unsigned)g_hotwait_rearm_count, (unsigned long)elapsed);
            LOGM("HOTWAIT_REARM", "try=%u,ms=%lu",
                 (unsigned)g_hotwait_rearm_count, (unsigned long)elapsed);
        }
        return;
    }
    if (elapsed >= HOTWAIT_ARMED_ABORT_MS) {
        abortHotWait("start_never_came");
    }
}

static void debugEspSetRamp(bool enable)
{
    g_debug_mode = enable;
    g_debug_count = 0;
    g_debug_last_us = (uint32_t)micros();
    if (enable) {
        g_store_fill  = 0;   /* reset store index para que cada test/debug empiece desde 0 */
        if (g_rec_n_batches == 0 && g_state != HOT_WAIT) {
            /* Modo streaming/test: A7 arranca la rampa inmediatamente. */
            g_t_start_us = (uint64_t)g_debug_last_us;
            g_state = SAMPLING;
        } else if (g_state == WAIT_ARM || g_state == STOPPED) {
            /* Store-and-forward: A7 solo selecciona debug; START/SYNC arranca. */
            g_state = ARMED;
        }
    } else if (g_state == SAMPLING) {
        g_state = STOPPED;
    } else if (g_rec_n_batches == 0 && g_state != HOT_WAIT) {
        g_state = WAIT_ARM;
    }
}

static void handleSetConfig(const MsgSetConfig *cfg)
{
    if (cfg->node_id != NODE_ID) return;
    if (g_state == SAMPLING) {
        SLAVE_LOG_PRINTF("[SLAVE] cfg ignored during capture sub=0x%02X\n",
                         cfg->sub_cmd);
        LOGM("CFG_IGN_CAPTURE", "sub=0x%02X", cfg->sub_cmd);
        return;   /* Sin ACK por radio mientras se muestrea. */
    }
    servicePsocConfigAck();
    if (g_cfg_waiting) {
        sendCfgAck(cfg->sub_cmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] cfg busy sub=0x%02X pending=0x%02X\n",
                         cfg->sub_cmd, g_cfg_sub_cmd);
        LOGM("CFG_BUSY", "sub=0x%02X,pending=0x%02X", cfg->sub_cmd, g_cfg_sub_cmd);
        return;
    }

    const uint8_t subCmd = cfg->sub_cmd;
    const uint8_t param = cfg->param;
    uint8_t ok = 1;
    bool waitAck = false;
    switch (cfg->sub_cmd) {
        case 0xA6:                       /* PGA */
            if (!isGainCode(param)) {
                ok = 0;
            } else {
                waitAck = true;
            }
            break;
        case 0xA9:                       /* PGAvdac */
            if (!isGainCode(param)) {
                ok = 0;
            } else {
                waitAck = true;
            }
            break;
        case 0xAA:                       /* VDAC (calibración) */
            waitAck = true;
            break;
        case PSOC_CMD_CALIBRATE:
            waitAck = true;
            break;
        case PSOC_CMD_SAVE_EEPROM:          /* 0xB6: guardar calibración en EEPROM */
            waitAck = true;
            break;
        case PSOC_CMD_SELECT_STREAM:        /* 0xB7: 0=crudo, 1=FIR hardware */
            waitAck = true;
            break;
        case PSOC_CMD_ADC_CONFIG:           /* 0xBA: 1=±2.5V, 2=±0.512V, 3=±1.024V, 4=±0.625V */
            if (!isAdcConfigCode(param)) {
                ok = 0;
            } else {
                waitAck = true;
            }
            break;
        case PSOC_CMD_SET_DECIMATION:       /* 0xBB: factor 1..100 (1=sin decimar) */
            if (!isDecimationFactor(param)) {
                ok = 0;
            } else {
                waitAck = true;
            }
            break;
        case PSOC_CMD_SD_CAPTURE:           /* 0xBE: 0/1 — modo captura a SD del PSoC */
            if (param > 1u) {
                ok = 0;
            } else {
                waitAck = true;
            }
            break;
        case SLAVE_CMD_SET_SD_ENABLE:       /* 0xC0: OBSOLETO (era SD-en-ESP32). La SD vive en el
                                             * PSoC; usar 0xBE. Se rechaza siempre. */
            ok = 0;
            break;                          /* waitAck queda false: ack inmediato abajo */
        default:
            ok = 0;
            break;
    }
    if (ok && waitAck) {
        if (!ensurePsocReadyForConfig()) {
            ok = 0;
            sendCfgAck(subCmd, ok);
        } else {
            switch (subCmd) {
                case 0xA6:
                    psoc.setPga(param);
                    break;
                case 0xA9:
                    psoc.setPgavdac(param);
                    break;
                case 0xAA:
                    psoc.setVdac(param);
                    break;
                case PSOC_CMD_CALIBRATE:
                    psoc.calibrate();
                    break;
                case PSOC_CMD_SAVE_EEPROM:
                    psoc.saveEeprom();
                    break;
                case PSOC_CMD_SELECT_STREAM:
                    psoc.selectStream(param);
                    break;
                case PSOC_CMD_ADC_CONFIG:
                    psoc.setAdcConfig(param);
                    break;
                case PSOC_CMD_SET_DECIMATION:
                    psoc.setDecimation(param);
                    break;
                case PSOC_CMD_SD_CAPTURE:
                    psoc.sdCapture(param);
                    break;
                default:
                    ok = 0;
                    break;
            }
            if (ok) {
                waitForPsocConfigAck(subCmd, param);
            } else {
                sendCfgAck(subCmd, ok);
            }
        }
    } else {
        sendCfgAck(subCmd, ok);
    }
    SLAVE_LOG_PRINTF("[SLAVE] cfg sub=0x%02X p=%u ok=%u\n",
                     subCmd, param, ok);
    LOGM("CFG", "sub=0x%02X,p=%u,ok=%u,wait=%u",
         subCmd, param, ok, (unsigned)waitAck);
}

