simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static void servicePsocSdReadTimeout()
{
    if (!g_psoc_sd_read_pending ||
        (uint32_t)(millis() - g_psoc_sd_read_started_ms) < PSOC_SD_READ_TIMEOUT_MS) {
        return;
    }
    if (!g_psoc_sd_read_usb) {
        MsgCfgAck nack = { CMD_CFG_ACK, NODE_ID, CMD_REQ_BATCH, 0 };
        sendToMaster((const uint8_t *)&nack, sizeof(nack));
    }
    SLAVE_LOG_PRINTF("[SLAVE] PSoC SD_READ timeout seq=%u usb=%u\n",
                     (unsigned)g_psoc_sd_read_seq, (unsigned)g_psoc_sd_read_usb);
    g_psoc_sd_read_pending = false;
    g_psoc_sd_read_usb = false;
}

/* ── Callback PSoC — batch recibido ─────────────────────────────────────── */

static void psocBatchToStored(const PsocBatch &batch, SampleBytes *dst)
{
    for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
        const PsocSample &s = batch.samples[i];
        dst[i].raw_lo = (uint8_t)(s.raw_input & 0xFF);
        dst[i].raw_hi = (uint8_t)((s.raw_input >> 8) & 0xFF);
        dst[i].alog0 = (uint8_t)(s.post_analog & 0xFF);
        dst[i].alog1 = (uint8_t)((s.post_analog >> 8) & 0xFF);
        dst[i].alog2 = (uint8_t)((s.post_analog >> 16) & 0xFF);
        dst[i].digi0 = (uint8_t)(s.post_digital & 0xFF);
        dst[i].digi1 = (uint8_t)((s.post_digital >> 8) & 0xFF);
        dst[i].digi2 = (uint8_t)((s.post_digital >> 16) & 0xFF);
        dst[i].gain = s.gain_byte;
        dst[i].flags = s.sample_flags;
    }
}

static void onBatch(const PsocBatch &batch)
{
    g_psocConnected = true;

    if (g_psoc_sd_read_pending) {
        if (batch.seq != g_psoc_sd_read_seq) {
            SLAVE_LOG_PRINTF("[SLAVE] SD batch seq=%u, esperado=%u: ignorado\n",
                             (unsigned)batch.seq, (unsigned)g_psoc_sd_read_seq);
            return;
        }
        SampleBytes stored[SPI_BATCH_SAMPLES];
        const uint16_t seq = g_psoc_sd_read_seq;
        uint32_t fs = effectivePsocSampleRateHz();
        if (fs == 0u) fs = PSOC_NATIVE_SAMPLE_RATE_HZ;
        psocBatchToStored(batch, stored);
        g_psoc_sd_read_pending = false;
        if (g_psoc_sd_read_usb) {
            /* Banco (sdread N): volcar resumen por USB en vez de ESP-NOW. */
            g_psoc_sd_read_usb = false;
            int32_t sum = 0;
            for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
                sum += (int32_t)batch.samples[i].raw_input;
            }
            SLAVE_LOG_PRINTF("[USB] SDREAD seq=%u raw[0]=%d raw[%d]=%d sumRaw=%ld "
                             "dig[0]=%ld dig[%d]=%ld flags[0]=0x%02X\n",
                             (unsigned)seq,
                             (int)batch.samples[0].raw_input,
                             SPI_BATCH_SAMPLES - 1,
                             (int)batch.samples[SPI_BATCH_SAMPLES - 1].raw_input,
                             (long)sum,
                             (long)batch.samples[0].post_digital,
                             SPI_BATCH_SAMPLES - 1,
                             (long)batch.samples[SPI_BATCH_SAMPLES - 1].post_digital,
                             (unsigned)batch.samples[0].sample_flags);
            return;
        }
        const uint64_t ts = g_t_start_us +
            ((uint64_t)seq * SPI_BATCH_SAMPLES * 1000000ULL) / fs;
        transport.sendStoredBatch(stored, seq, ts, NODE_ID);
        return;
    }

    if (g_state != SAMPLING || g_psoc_sd_store_active) return;

    if (g_view_remaining > 0) {
        g_view_remaining = 0;   /* fail-safe: VIEW live no debe transmitir mientras muestrea */
    }

    /* Store-and-forward RAM: el camino SD no llega aquí; se lee por 0xBF. */
    if (storeRamReady() && g_store_fill < g_rec_n_batches) {
        SampleBytes *dst = storeBatchPtr(g_store_fill);
        if (!dst) {
            return;
        }
        psocBatchToStored(batch, dst);
        uint32_t tsRel = (uint32_t)batch.timestamp_us;
        g_store_ts_us[g_store_fill] = tsRel;
        g_store_fill++;
        if (g_store_fill >= g_rec_n_batches) {
            g_state = STOPPED;
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);
            SLAVE_LOG_PRINTF("[SLAVE] FULL -> STOPPED (%u batches)\n", g_store_fill);
            if (g_view_store_active) {
                g_view_store_active = false;
                g_start_store_active = false;
                sendCompletionAckWithRetry(CMD_VIEW);   /* VIEW_DONE: ahora sí puede empezar el dump */
                SLAVE_LOG_PRINTF("[SLAVE] VIEW capture done -> ACK\n");
                LOGM("VIEWDONE", "store=1,n=%u", g_store_fill);
            } else if (g_start_store_active) {
                g_start_store_active = false;
                sendCompletionAckWithRetry(CMD_START);  /* START_DONE: master puede dumpear */
                SLAVE_LOG_PRINTF("[SLAVE] START capture done -> ACK\n");
                LOGM("STARTDONE", "store=1,n=%u", g_store_fill);
            }
        }
    } else if (g_debug_mode) {
        /* Test: transmitir en vivo la rampa (no es señal ADC real, RF no afecta). */
        SampleBytes sb[SPI_BATCH_SAMPLES];
        for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
            const PsocSample &ps = batch.samples[i];
            sb[i].raw_lo = (uint8_t)( ps.raw_input          & 0xFF);
            sb[i].raw_hi = (uint8_t)((ps.raw_input   >>  8) & 0xFF);
            sb[i].alog0  = (uint8_t)( ps.post_analog         & 0xFF);
            sb[i].alog1  = (uint8_t)((ps.post_analog  >>  8) & 0xFF);
            sb[i].alog2  = (uint8_t)((ps.post_analog  >> 16) & 0xFF);
            sb[i].digi0  = (uint8_t)( ps.post_digital         & 0xFF);
            sb[i].digi1  = (uint8_t)((ps.post_digital >>  8) & 0xFF);
            sb[i].digi2  = (uint8_t)((ps.post_digital >> 16) & 0xFF);
            sb[i].gain   = ps.gain_byte;
            sb[i].flags  = ps.sample_flags;
        }
        uint64_t ts = g_t_start_us + (uint64_t)batch.timestamp_us;
        transport.sendStoredBatch(sb, g_store_fill, ts, NODE_ID);
        g_store_fill++;
    }
}

/* ── Seguimiento del canal del maestro ───────────────────────────────────── */

#if !defined(ESP8266)
/* Busca el AP del maestro por SSID y devuelve su canal. Bloquea ~2 s (el escaneo
 * pasa por los 13 canales); solo se llama en boot o cuando ya no hay trafico, o
 * sea nunca durante una captura. */
static uint8_t findMasterChannel(uint8_t fallback)
{
    int n = WiFi.scanNetworks(false /*async*/, true /*hidden*/);
    uint8_t ch = 0;
    int32_t best = -1000;
    for (int i = 0; i < n; i++) {
        if (WiFi.SSID(i) != MASTER_AP_SSID) continue;
        /* Puede haber más de un maestro al alcance: quedarse con el más fuerte. */
        if (WiFi.RSSI(i) > best) { best = WiFi.RSSI(i); ch = WiFi.channel(i); }
    }
    WiFi.scanDelete();
    if (ch == 0) {
        SLAVE_LOG_PRINTF("[SLAVE] AP '%s' no encontrado en %d redes; canal %u\n",
                         MASTER_AP_SSID, n, fallback);
        return fallback;
    }
    SLAVE_LOG_PRINTF("[SLAVE] AP '%s' en canal %u (%d dBm)\n",
                     MASTER_AP_SSID, ch, (int)best);
    return ch;
}

/* Si el maestro deja de hablar, puede haberse movido de canal (se asocio a la red
 * del cliente y arrastro su AP). Rescanear y reengancharse.
 * Se gatea por estado: durante SAMPLING el silencio es normal —el protocolo es
 * maestro-iniciado— y un escaneo ahi arruinaria la captura. */
static void masterChannelService()
{
    if (g_state == SAMPLING || g_state == HOT_WAIT) return;
    if (g_lastMasterRxMs == 0) return;      /* nunca hablo: el boot ya escaneo */
    if ((millis() - g_lastMasterRxMs) < MASTER_SILENCE_MS) return;

    uint8_t ch = findMasterChannel(g_masterChannel);
    if (ch != g_masterChannel) {
        SLAVE_LOG_PRINTF("[SLAVE] maestro cambio de canal %u -> %u\n",
                         g_masterChannel, ch);
        g_masterChannel = ch;
        esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE);
    }
    /* Reiniciar el reloj aunque el canal no haya cambiado: si no, se rescanea en
     * bucle cada pasada de loop() mientras el maestro siga callado. */
    g_lastMasterRxMs = millis();
}
#else
static uint8_t findMasterChannel(uint8_t fallback) { return fallback; }
static void masterChannelService() {}
#endif

/* ── Setup ───────────────────────────────────────────────────────────────── */

void setup()
{
    dbgLogBegin(DBG_LOG_BAUD);   /* Serial USB del esclavo = canal de log */
    SLAVE_LOG_PRINTF("[SLAVE %d] boot\n", NODE_ID);
    /* SD-en-ESP32 purgada (2026-07-11): la SD vive en el PSoC. sd_storage.*
     * queda como stub sin inicializar; sd_present sale de PSOC_EVT_SD_STATUS. */
    /* Heap: el store usa paginas de STORE_PAGE_BATCHES lotes, asi el limite
     * RAM-only lo da la suma de heap util y el buffer PSoC, no un bloque gigante. */
    SLAVE_LOG_PRINTF("[SLAVE %d] heap free=%u maxAlloc=%u (~%u lotes contiguos antiguos)\n",
                     NODE_ID, (unsigned)ESP.getFreeHeap(),
                     (unsigned)ESP.getMaxAllocHeap(),
                     (unsigned)(ESP.getMaxAllocHeap() / 304u));
    samplePulseBegin();
    debugEspHardwareBegin();
    localUiBegin();
    SLAVE_LOG_PRINTF("[SCOPE] sample pulse pin=%d idle=%d us=%d\n",
                     SAMPLE_PULSE_PIN, SAMPLE_PULSE_IDLE, SAMPLE_PULSE_US);
    SLAVE_LOG_PRINTF("[SCOPE] debugHardware=%d start pin=%d idle=%d us=%d\n",
                     DEBUG_HARDWARE, DEBUG_HW_START_PIN,
                     DEBUG_HW_START_IDLE, DEBUG_HW_START_US);

