simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
#if defined(ESP8266)
    /* Modo AP oculto en canal 1: evita el background scanning que hace el
     * ESP8266 en modo STA desconectado (recorre ch1-13 buscando APs y pierde
     * paquetes ESP-NOW del canal 1 a distancia real). */
    WiFi.mode(WIFI_AP);
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
    WiFi.setOutputPower(20.5f);
    WiFi.softAP("GeoSlave", "", 1, 1);   /* ssid, pass vacío, canal 1, oculto */
    delay(100);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d (AP-fixed)\n",
                     WiFi.macAddress().c_str(), wifi_get_channel());
#else
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    esp_wifi_set_ps(WIFI_PS_NONE);
    esp_wifi_set_max_tx_power(WIFI_TX_POWER_QDBM);
    WiFi.disconnect();
    delay(100);
    /* Adoptar el canal del AP del maestro en vez de fijar el 1: el maestro puede
     * estar arrastrado al canal de la red del cliente. Si no se lo encuentra se
     * usa el 1, que es donde arranca su AP. Ver el comentario de arriba. */
    g_masterChannel = findMasterChannel(MASTER_CH_FALLBACK);
    esp_wifi_set_channel(g_masterChannel, WIFI_SECOND_CHAN_NONE);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d (maestro)\n",
                     WiFi.macAddress().c_str(), WiFi.channel());
    SLAVE_LOG_PRINTF("[SLAVE] WiFi ps=off tx=%d qdBm\n", WIFI_TX_POWER_QDBM);
#endif

    /* ESP-NOW */
    if (!transport.begin(g_masterTxMac)) {
        SLAVE_LOG_PRINTLN("[SLAVE] ESP-NOW FAIL - halt");
        while (true) { delay(1000); }
    }
    esp_now_register_recv_cb(onDataRecv);

    /* (El LED de identificación es el del PSoC; el ESP ya no maneja ningún LED.) */

    /* GPIO hardware sync — pull-down para evitar ISR espurias cuando no hay cable */
    pinMode(SYNC_IN_PIN,      INPUT_PULLDOWN);
    pinMode(SYNC_TO_PSOC_PIN, OUTPUT);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    attachInterrupt(digitalPinToInterrupt(SYNC_IN_PIN), onSyncEdge, CHANGE);

    /* UART → PSoC */
    psoc.begin(onBatch);
    psoc.onDiag(onPsocDiag);
    g_psoc_rx_last_level = (uint8_t)digitalRead(PSOC_UART_RX);
    attachInterrupt(digitalPinToInterrupt(PSOC_UART_RX), onPsocRxEdge, CHANGE);
#if PSOC_RX_SCAN_ENABLE
    beginPsocRxScan();
#endif

    /* Intentar detectar el PSoC una vez. Si no responde, se reintenta cada 2 s
     * en loop() para no bloquear ESP-NOW ni la generación de batches debug. */
    SLAVE_LOG_PRINTF("[SLAVE %d] Buscando PSoC...\n", NODE_ID);
    g_psocConnected = psoc.probe(300);
    if (g_psocConnected) {
        SLAVE_LOG_PRINTF("[SLAVE %d] PSoC: DETECTADO\n", NODE_ID);
        LOGM("PSOC", "detected=1");
        scheduleAutoCalibration(PSOC_AUTO_CAL_DELAY_MS);
    } else {
        SLAVE_LOG_PRINTF("[SLAVE %d] PSoC sin respuesta — reintentando en loop\n", NODE_ID);
        LOGM("PSOC", "detected=0,retry=loop");
    }

    SLAVE_LOG_PRINTF("[SLAVE %d] listo, esperando ARM\n", NODE_ID);
    LOGM("BOOT", "node=%d,psoc=%d", NODE_ID, (int)g_psocConnected);
}

/* ── Loop ────────────────────────────────────────────────────────────────── */

void loop()
{
    if (g_state != SAMPLING) {
        debugEspHardwareService();
        /* Reengancharse al canal del maestro si dejo de hablar. No corre durante
         * SAMPLING/HOT_WAIT: ahi el silencio es parte del protocolo. */
        masterChannelService();
    }

    /* Drenar siempre la UART del PSoC (onBatch ignora si no está SAMPLING). */
    if (g_state == SAMPLING && g_debug_mode) {
        /* Debug ESP: un lote falso cada 30/2604 s. La expresión redondeada
         * mantiene esta ruta de laboratorio ligada a la Fs nativa canónica. */
        static const uint32_t DEBUG_BATCH_PERIOD_US =
            (SPI_BATCH_SAMPLES * 1000000UL + PSOC_NATIVE_SAMPLE_RATE_HZ / 2UL) /
            PSOC_NATIVE_SAMPLE_RATE_HZ;
        uint32_t nowUs = (uint32_t)micros();
        if ((uint32_t)(nowUs - g_debug_last_us) >= DEBUG_BATCH_PERIOD_US) {
            g_debug_last_us += DEBUG_BATCH_PERIOD_US;
            PsocBatch fake = {};
            fake.seq         = (uint16_t)(g_debug_count / SPI_BATCH_SAMPLES);
            fake.n_samples   = SPI_BATCH_SAMPLES;
            fake.timestamp_us= (uint64_t)micros() - g_t_start_us;
            for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
                fake.samples[i].post_digital = (int32_t)(g_debug_count & 0xFFFFFF);
                fake.samples[i].gain_byte = g_pga_code;
                fake.samples[i].sample_flags = 0;
                g_debug_count++;
            }
            onBatch(fake);
        }
    } else {
        psoc.poll();
    }
    servicePsocConfigAck();
    servicePsocSdReadTimeout();
    serviceUsbCommands();
    serviceAutoCalibration();
    serviceCompletionAckRetry();
    serviceLocalUi();
    serviceHotWaitWatchdog();

    /* Arranque por flanco GPIO (onSyncEdge): completar fuera del ISR el mismo
     * bookkeeping que hace el handler de CMD_START, para que la captura por
     * sync de hardware también emita el ACK de completado y el fallback. */
    if (g_sync_edge_started) {
        g_sync_edge_started = false;
        g_sampling_start_ms = millis();
        g_sampling_start_psoc_bytes = psoc.bytesRx();
        g_sampling_start_batches_ok = psoc.batchesOK();
        g_start_fallback_sent = false;
        if (!g_view_store_active) {
            g_start_store_active = (g_rec_n_batches > 0 && storeAllocated());
        }
    }

    /* (El parpadeo de identificación lo hace ahora el PSoC con su Timer; el ESP
     * solo reenvía CMD_BLINK_LED por UART en onDataRecv.) */

    /* Mientras se llena el store (Ver/Test con n_batches>0), imprimir UART cada 1 s.
     * Esto separa cable/pin (uartBytes=0) de protocolo/baud (bytes sin frames)
     * de "onBatch no incrementa fill" (psoc.poll() no entrega PsocBatch). */
#if SLAVE_LOG_VIEW_UART
    static uint32_t lastViewDiagMs = 0;
    if (g_state == SAMPLING && g_rec_n_batches > 0 &&
        (millis() - lastViewDiagMs) >= 1000) {
        lastViewDiagMs = millis();
        logPsocUartDiag("VIEW_UART");
    }
#endif

    bool storeCaptureActive = g_view_store_active || g_start_store_active;
    if (g_state == SAMPLING && storeCaptureActive && g_rec_n_batches > 0 &&
        g_store_fill == 0 && !g_start_fallback_sent) {
        uint32_t elapsedMs = millis() - g_sampling_start_ms;
        uint32_t fallbackMs = expectedCaptureMs(g_rec_n_batches);
        uint32_t bytesNow = psoc.bytesRx();
        uint32_t batchesNow = psoc.batchesOK();
        const bool sdCapture = g_psoc_sd_store_active;
        if (sdCapture) {
            /* F1 (aceptación 10 min, 2026-07-11): en captura a SD NO llegan
             * lotes UART durante el muestreo (fill/bOK congelados por diseño)
             * y el cierre de GEOLAST.BIN crece con el tamaño (~3.3 s a 52080
             * lotes). Con el margen fijo, este watchdog declaraba stall justo
             * antes del SD_SESSION y el START_NOW fantasma re-armaba el PSoC
             * pisando la sesión recién terminada (SD_ERROR 0x08 + NACK eterno
             * al dump del maestro). Margen extra proporcional al largo. */
            fallbackMs += 15000u + (uint32_t)(g_rec_n_batches / 2u);
        }
        if (elapsedMs >= fallbackMs && batchesNow == g_sampling_start_batches_ok) {
            const char *mode = g_view_store_active ? "VIEW" : "START";
            g_start_fallback_sent = true;
            SLAVE_LOG_PRINTF("[SLAVE] %s_SYNC_STALL elapsed=%lu/%lu sync=%d bytes=%lu->%lu bOK=%lu->%lu fill=%u/%u sd=%u -> %s\n",
                             mode,
                             (unsigned long)elapsedMs, (unsigned long)fallbackMs,
                             digitalRead(SYNC_TO_PSOC_PIN),
                             (unsigned long)g_sampling_start_psoc_bytes,
                             (unsigned long)bytesNow,
                             (unsigned long)g_sampling_start_batches_ok,
                              (unsigned long)batchesNow,
                              (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
                              (unsigned)sdCapture,
                              sdCapture ? "ABORT (sin START_NOW)" : "START_NOW UART");
            LOGM("CAPTURE_SYNC_STALL", "mode=%s,ms=%lu/%lu,sync=%d,bytes=%lu->%lu,bOK=%lu->%lu,fill=%u/%u,sd=%u",
                 mode,
                 (unsigned long)elapsedMs, (unsigned long)fallbackMs,
                 digitalRead(SYNC_TO_PSOC_PIN),
                 (unsigned long)g_sampling_start_psoc_bytes,
                 (unsigned long)bytesNow,
                 (unsigned long)g_sampling_start_batches_ok,
                 (unsigned long)batchesNow,
                 (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
                 (unsigned)sdCapture);
            if (sdCapture) {
                /* NUNCA re-arrancar el PSoC en modo SD: si la captura estaba
                 * por cerrar, START_NOW la destruye. Abort limpio: NACK al
                 * maestro y a esperar; los datos (si los hay) siguen en la SD. */
                const bool wasView = g_view_store_active;
                digitalWrite(SYNC_TO_PSOC_PIN, LOW);
                g_view_store_active = false;
                g_start_store_active = false;
                g_state = STOPPED;
                sendCfgAck(wasView ? CMD_VIEW : CMD_START, 0);
            } else {
                psoc.startNow();
            }
        }
    }

